#include <unistd.h>///<for sleep
#include <stdlib.h>//for free function
#include <stdio.h>//for printf function
#include <string.h>//for memcpy function
#include <sys/socket.h>
#include "timer.h"
#include "message.h"
#include "task.h"
#include "os.h"// for mutex send_cmd rcv_cmd
#include "syslink.h"
#ifdef CONFIG_SYSLINK
#include "vdsp.h"
#include "AppCommon.h"
#define MAXITEM 1000//用于总招数据
static Item items[MAXITEM];
static char msg_buf[32*1024];
int8 start_syslink=0;
Vdsp vdsp;
static int32 AllYx[] = {
	YX_0001	,	//线路1开关合位
	YX_0002	,	//线路1开关分位
	YX_0003	,	//线路1开关储能位
	YX_0004	,	//线路1备用遥信1
	YX_0005	,	//线路1备用遥信2
	YX_0006	,	//线路1备用遥信3
	YX_0007	,	//线路1一段速断故障信号
	YX_0008	,	//线路1二段过流故障信号
	YX_0009	,	//线路1三段过负荷故障信号
	YX_000A	,	//线路1相间短路故障
	YX_000B	,	//线路1单相接地故障信号
	YX_000C	,	//线路1瞬时故障信号
	YX_000D	,	//线路1永久故障信号
	YX_000E	,	//线路1零序电压故障信号
	YX_000F	,	//线路1零序电流故障信号
	YX_0010	,	//线路1一段保护动作信号
	YX_0011	,	//线路1二段保护动作信号
	YX_0012	,	//线路1三段保护动作信号
	YX_0013	,	//线路1单相接地保护动作信号
	YX_0014	,	//线路1PT断线
	YX_0015	,	//线路1CT断线
	YX_0016	,	//线路1本地合闸
	YX_0017	,	//线路1本地分闸
	YX_0018	,	//线路2开关合位
	YX_0019	,	//线路2开关分位
	YX_001A	,	//线路2开关储能位
	YX_001B	,	//线路2备用遥信1
	YX_001C	,	//线路2备用遥信2
	YX_001D	,	//线路2备用遥信3
	YX_001E	,	//线路2一段速断故障信号
	YX_001F	,	//线路2二段过流故障信号
	YX_0020	,	//线路2三段过负荷故障信号
	YX_0021	,	//线路2相间短路故障
	YX_0022	,	//线路2单相接地故障信号
	YX_0023	,	//线路2瞬时故障信号
	YX_0024	,	//线路2永久故障信号
	YX_0025	,	//线路2零序电压故障信号
	YX_0026	,	//线路2零序电流故障信号
	YX_0027	,	//线路2一段保护动作信号
	YX_0028	,	//线路2二段保护动作信号
	YX_0029	,	//线路2三段保护动作信号
	YX_002A	,	//线路2单相接地保护动作信号
	YX_002B	,	//线路2PT断线
	YX_002C	,	//线路2CT断线
	YX_002D	,	//线路2本地合闸
	YX_002E	,	//线路2本地分闸
	YX_002F	,	//线路3开关合位
	YX_0030	,	//线路3开关分位
	YX_0031	,	//线路3开关储能位
	YX_0032	,	//线路3备用遥信1
	YX_0033	,	//线路3备用遥信2
	YX_0034	,	//线路3备用遥信3
	YX_0035	,	//线路3一段速断故障信号
	YX_0036	,	//线路3二段过流故障信号
	YX_0037	,	//线路3三段过负荷故障信号
	YX_0038	,	//线路3相间短路故障
	YX_0039	,	//线路3单相接地故障信号
	YX_003A	,	//线路3瞬时故障信号
	YX_003B	,	//线路3永久故障信号
	YX_003C	,	//线路3零序电压故障信号
	YX_003D	,	//线路3零序电流故障信号
	YX_003E	,	//线路3一段保护动作信号
	YX_003F	,	//线路3二段保护动作信号
	YX_0040	,	//线路3三段保护动作信号
	YX_0041	,	//线路3单相接地保护动作信号
	YX_0042	,	//线路3PT断线
	YX_0043	,	//线路3CT断线
	YX_0044	,	//线路3本地合闸
	YX_0045	,	//线路3本地分闸
	YX_0046	,	//线路4开关合位
	YX_0047	,	//线路4开关分位
	YX_0048	,	//线路4开关储能位
	YX_0049	,	//线路4备用遥信1
	YX_004A	,	//线路4备用遥信2
	YX_004B	,	//线路4备用遥信3
	YX_004C	,	//线路4一段速断故障信号
	YX_004D	,	//线路4二段过流故障信号
	YX_004E	,	//线路4三段过负荷故障信号
	YX_004F	,	//线路4相间短路故障
	YX_0050	,	//线路4单相接地故障信号
	YX_0051	,	//线路4瞬时故障信号
	YX_0052	,	//线路4永久故障信号
	YX_0053	,	//线路4零序电压故障信号
	YX_0054	,	//线路4零序电流故障信号
	YX_0055	,	//线路4一段保护动作信号
	YX_0056	,	//线路4二段保护动作信号
	YX_0057	,	//线路4三段保护动作信号
	YX_0058	,	//线路4单相接地保护动作信号
	YX_0059	,	//线路4PT断线
	YX_005A	,	//线路4CT断线
	YX_005B	,	//线路4本地合闸
	YX_005C	,	//线路4本地分闸
	YX_005D	,	//线路5开关合位
	YX_005E	,	//线路5开关分位
	YX_005F	,	//线路5开关储能位
	YX_0060	,	//线路5备用遥信1
	YX_0061	,	//线路5备用遥信2
	YX_0062	,	//线路5备用遥信3
	YX_0063	,	//线路5一段速断故障信号
	YX_0064	,	//线路5二段过流故障信号
	YX_0065	,	//线路5三段过负荷故障信号
	YX_0066	,	//线路5相间短路故障
	YX_0067	,	//线路5单相接地故障信号
	YX_0068	,	//线路5瞬时故障信号
	YX_0069	,	//线路5永久故障信号
	YX_006A	,	//线路5零序电压故障信号
	YX_006B	,	//线路5零序电流故障信号
	YX_006C	,	//线路5一段保护动作信号
	YX_006D	,	//线路5二段保护动作信号
	YX_006E	,	//线路5三段保护动作信号
	YX_006F	,	//线路5单相接地保护动作信号
	YX_0070	,	//线路5PT断线
	YX_0071	,	//线路5CT断线
	YX_0072	,	//线路5本地合闸
	YX_0073	,	//线路5本地分闸
	YX_0074	,	//线路6开关合位
	YX_0075	,	//线路6开关分位
	YX_0076	,	//线路6开关储能位
	YX_0077	,	//线路6备用遥信1
	YX_0078	,	//线路6备用遥信2
	YX_0079	,	//线路6备用遥信3
	YX_007A	,	//线路6一段速断故障信号
	YX_007B	,	//线路6二段过流故障信号
	YX_007C	,	//线路6三段过负荷故障信号
	YX_007D	,	//线路6相间短路故障
	YX_007E	,	//线路6单相接地故障信号
	YX_007F	,	//线路6瞬时故障信号
	YX_0080	,	//线路6永久故障信号
	YX_0081	,	//线路6零序电压故障信号
	YX_0082	,	//线路6零序电流故障信号
	YX_0083	,	//线路6一段保护动作信号
	YX_0084	,	//线路6二段保护动作信号
	YX_0085	,	//线路6三段保护动作信号
	YX_0086	,	//线路6单相接地保护动作信号
	YX_0087	,	//线路6PT断线
	YX_0088	,	//线路6CT断线
	YX_0089	,	//线路6本地合闸
	YX_008A	,	//线路6本地分闸
	YX_008B	,	//线路7开关合位
	YX_008C	,	//线路7开关分位
	YX_008D	,	//线路7开关储能位
	YX_008E	,	//线路7备用遥信1
	YX_008F	,	//线路7备用遥信2
	YX_0090	,	//线路7备用遥信3
	YX_0091	,	//线路7一段速断故障信号
	YX_0092	,	//线路7二段过流故障信号
	YX_0093	,	//线路7三段过负荷故障信号
	YX_0094	,	//线路7相间短路故障
	YX_0095	,	//线路7单相接地故障信号
	YX_0096	,	//线路7瞬时故障信号
	YX_0097	,	//线路7永久故障信号
	YX_0098	,	//线路7零序电压故障信号
	YX_0099	,	//线路7零序电流故障信号
	YX_009A	,	//线路7一段保护动作信号
	YX_009B	,	//线路7二段保护动作信号
	YX_009C	,	//线路7三段保护动作信号
	YX_009D	,	//线路7单相接地保护动作信号
	YX_009E	,	//线路7PT断线
	YX_009F	,	//线路7CT断线
	YX_00A0	,	//线路7本地合闸
	YX_00A1	,	//线路7本地分闸
	YX_00A2	,	//线路8开关合位
	YX_00A3	,	//线路8开关分位
	YX_00A4	,	//线路8开关储能位
	YX_00A5	,	//线路8备用遥信1
	YX_00A6	,	//线路8备用遥信2
	YX_00A7	,	//线路8备用遥信3
	YX_00A8	,	//线路8一段速断故障信号
	YX_00A9	,	//线路8二段过流故障信号
	YX_00AA	,	//线路8三段过负荷故障信号
	YX_00AB	,	//线路8相间短路故障
	YX_00AC	,	//线路8单相接地故障信号
	YX_00AD	,	//线路8瞬时故障信号
	YX_00AE	,	//线路8永久故障信号
	YX_00AF	,	//线路8零序电压故障信号
	YX_00B0	,	//线路8零序电流故障信号
	YX_00B1	,	//线路8一段保护动作信号
	YX_00B2	,	//线路8二段保护动作信号
	YX_00B3	,	//线路8三段保护动作信号
	YX_00B4	,	//线路8单相接地保护动作信号
	YX_00B5	,	//线路8PT断线
	YX_00B6	,	//线路8CT断线
	YX_00B7	,	//线路8本地合闸
	YX_00B8	,	//线路8本地分闸
	YX_00B9	,	//线路9开关合位
	YX_00BA	,	//线路9开关分位
	YX_00BB	,	//线路9开关储能位
	YX_00BC	,	//线路9备用遥信1
	YX_00BD	,	//线路9备用遥信2
	YX_00BE	,	//线路9备用遥信3
	YX_00BF	,	//线路9一段速断故障信号
	YX_00C0	,	//线路9二段过流故障信号
	YX_00C1	,	//线路9三段过负荷故障信号
	YX_00C2	,	//线路9相间短路故障
	YX_00C3	,	//线路9单相接地故障信号
	YX_00C4	,	//线路9瞬时故障信号
	YX_00C5	,	//线路9永久故障信号
	YX_00C6	,	//线路9零序电压故障信号
	YX_00C7	,	//线路9零序电流故障信号
	YX_00C8	,	//线路9一段保护动作信号
	YX_00C9	,	//线路9二段保护动作信号
	YX_00CA	,	//线路9三段保护动作信号
	YX_00CB	,	//线路9单相接地保护动作信号
	YX_00CC	,	//线路9PT断线
	YX_00CD	,	//线路9CT断线
	YX_00CE	,	//线路9本地合闸
	YX_00CF	,	//线路9本地分闸
	YX_00D0	,	//线路10开关合位
	YX_00D1	,	//线路10开关分位
	YX_00D2	,	//线路10开关储能位
	YX_00D3	,	//线路10备用遥信1
	YX_00D4	,	//线路10备用遥信2
	YX_00D5	,	//线路10备用遥信3
	YX_00D6	,	//线路10一段速断故障信号
	YX_00D7	,	//线路10二段过流故障信号
	YX_00D8	,	//线路10三段过负荷故障信号
	YX_00D9	,	//线路10相间短路故障
	YX_00DA	,	//线路10单相接地故障信号
	YX_00DB	,	//线路10瞬时故障信号
	YX_00DC	,	//线路10永久故障信号
	YX_00DD	,	//线路10零序电压故障信号
	YX_00DE	,	//线路10零序电流故障信号
	YX_00DF	,	//线路10一段保护动作信号
	YX_00E0	,	//线路10二段保护动作信号
	YX_00E1	,	//线路10三段保护动作信号
	YX_00E2	,	//线路10单相接地保护动作信号
	YX_00E3	,	//线路10PT断线
	YX_00E4	,	//线路10CT断线
	YX_00E5	,	//线路10本地合闸
	YX_00E6	,	//线路10本地分闸
	YX_00E7	,	//线路11开关合位
	YX_00E8	,	//线路11开关分位
	YX_00E9	,	//线路11开关储能位
	YX_00EA	,	//线路11备用遥信1
	YX_00EB	,	//线路11备用遥信2
	YX_00EC	,	//线路11备用遥信3
	YX_00ED	,	//线路11一段速断故障信号
	YX_00EE	,	//线路11二段过流故障信号
	YX_00EF	,	//线路11三段过负荷故障信号
	YX_00F0	,	//线路11相间短路故障
	YX_00F1	,	//线路11单相接地故障信号
	YX_00F2	,	//线路11瞬时故障信号
	YX_00F3	,	//线路11永久故障信号
	YX_00F4	,	//线路11零序电压故障信号
	YX_00F5	,	//线路11零序电流故障信号
	YX_00F6	,	//线路11一段保护动作信号
	YX_00F7	,	//线路11二段保护动作信号
	YX_00F8	,	//线路11三段保护动作信号
	YX_00F9	,	//线路11单相接地保护动作信号
	YX_00FA	,	//线路11PT断线
	YX_00FB	,	//线路11CT断线
	YX_00FC	,	//线路11本地合闸
	YX_00FD	,	//线路11本地分闸
	YX_00FE	,	//线路12开关合位
	YX_00FF	,	//线路12开关分位
	YX_0100	,	//线路12开关储能位
	YX_0101	,	//线路12备用遥信1
	YX_0102	,	//线路12备用遥信2
	YX_0103	,	//线路12备用遥信3
	YX_0104	,	//线路12一段速断故障信号
	YX_0105	,	//线路12二段过流故障信号
	YX_0106	,	//线路12三段过负荷故障信号
	YX_0107	,	//线路12相间短路故障
	YX_0108	,	//线路12单相接地故障信号
	YX_0109	,	//线路12瞬时故障信号
	YX_010A	,	//线路12永久故障信号
	YX_010B	,	//线路12零序电压故障信号
	YX_010C	,	//线路12零序电流故障信号
	YX_010D	,	//线路12一段保护动作信号
	YX_010E	,	//线路12二段保护动作信号
	YX_010F	,	//线路12三段保护动作信号
	YX_0110	,	//线路12单相接地保护动作信号
	YX_0111	,	//线路12PT断线
	YX_0112	,	//线路12CT断线
	YX_0113	,	//线路12本地合闸
	YX_0114	,	//线路12本地分闸
	YX_0115	,	//线路13开关合位
	YX_0116	,	//线路13开关分位
	YX_0117	,	//线路13开关储能位
	YX_0118	,	//线路13备用遥信1
	YX_0119	,	//线路13备用遥信2
	YX_011A	,	//线路13备用遥信3
	YX_011B	,	//线路13一段速断故障信号
	YX_011C	,	//线路13二段过流故障信号
	YX_011D	,	//线路13三段过负荷故障信号
	YX_011E	,	//线路13相间短路故障
	YX_011F	,	//线路13单相接地故障信号
	YX_0120	,	//线路13瞬时故障信号
	YX_0121	,	//线路13永久故障信号
	YX_0122	,	//线路13零序电压故障信号
	YX_0123	,	//线路13零序电流故障信号
	YX_0124	,	//线路13一段保护动作信号
	YX_0125	,	//线路13二段保护动作信号
	YX_0126	,	//线路13三段保护动作信号
	YX_0127	,	//线路13单相接地保护动作信号
	YX_0128	,	//线路13PT断线
	YX_0129	,	//线路13CT断线
	YX_012A	,	//线路13本地合闸
	YX_012B	,	//线路13本地分闸
	YX_012C	,	//线路14开关合位
	YX_012D	,	//线路14开关分位
	YX_012E	,	//线路14开关储能位
	YX_012F	,	//线路14备用遥信1
	YX_0130	,	//线路14备用遥信2
	YX_0131	,	//线路14备用遥信3
	YX_0132	,	//线路14一段速断故障信号
	YX_0133	,	//线路14二段过流故障信号
	YX_0134	,	//线路14三段过负荷故障信号
	YX_0135	,	//线路14相间短路故障
	YX_0136	,	//线路14单相接地故障信号
	YX_0137	,	//线路14瞬时故障信号
	YX_0138	,	//线路14永久故障信号
	YX_0139	,	//线路14零序电压故障信号
	YX_013A	,	//线路14零序电流故障信号
	YX_013B	,	//线路14一段保护动作信号
	YX_013C	,	//线路14二段保护动作信号
	YX_013D	,	//线路14三段保护动作信号
	YX_013E	,	//线路14单相接地保护动作信号
	YX_013F	,	//线路14PT断线
	YX_0140	,	//线路14CT断线
	YX_0141	,	//线路14本地合闸
	YX_0142	,	//线路14本地分闸
	YX_0143	,	//线路15开关合位
	YX_0144	,	//线路15开关分位
	YX_0145	,	//线路15开关储能位
	YX_0146	,	//线路15备用遥信1
	YX_0147	,	//线路15备用遥信2
	YX_0148	,	//线路15备用遥信3
	YX_0149	,	//线路15一段速断故障信号
	YX_014A	,	//线路15二段过流故障信号
	YX_014B	,	//线路15三段过负荷故障信号
	YX_014C	,	//线路15相间短路故障
	YX_014D	,	//线路15单相接地故障信号
	YX_014E	,	//线路15瞬时故障信号
	YX_014F	,	//线路15永久故障信号
	YX_0150	,	//线路15零序电压故障信号
	YX_0151	,	//线路15零序电流故障信号
	YX_0152	,	//线路15一段保护动作信号
	YX_0153	,	//线路15二段保护动作信号
	YX_0154	,	//线路15三段保护动作信号
	YX_0155	,	//线路15单相接地保护动作信号
	YX_0156	,	//线路15PT断线
	YX_0157	,	//线路15CT断线
	YX_0158	,	//线路15本地合闸
	YX_0159	,	//线路15本地分闸
	YX_015A	,	//线路16开关合位
	YX_015B	,	//线路16开关分位
	YX_015C	,	//线路16开关储能位
	YX_015D	,	//线路16备用遥信1
	YX_015E	,	//线路16备用遥信2
	YX_015F	,	//线路16备用遥信3
	YX_0160	,	//线路16一段速断故障信号
	YX_0161	,	//线路16二段过流故障信号
	YX_0162	,	//线路16三段过负荷故障信号
	YX_0163	,	//线路16相间短路故障
	YX_0164	,	//线路16单相接地故障信号
	YX_0165	,	//线路16瞬时故障信号
	YX_0166	,	//线路16永久故障信号
	YX_0167	,	//线路16零序电压故障信号
	YX_0168	,	//线路16零序电流故障信号
	YX_0169	,	//线路16一段保护动作信号
	YX_016A	,	//线路16二段保护动作信号
	YX_016B	,	//线路16三段保护动作信号
	YX_016C	,	//线路16单相接地保护动作信号
	YX_016D	,	//线路16PT断线
	YX_016E	,	//线路16CT断线
	YX_016F	,	//线路16本地合闸
	YX_0170	,	//线路16本地分闸
	YX_0171	,	//断路器1双点遥信
	YX_0172	,	//断路器2双点遥信
	YX_0173	,	//断路器3双点遥信
	YX_0174	,	//断路器4双点遥信
	YX_0175	,	//断路器5双点遥信
	YX_0176	,	//断路器6双点遥信
	YX_0177	,	//断路器7双点遥信
	YX_0178	,	//断路器8双点遥信
	YX_0179	,	//断路器9双点遥信
	YX_017A	,	//断路器10双点遥信
	YX_017B	,	//断路器11双点遥信
	YX_017C	,	//断路器12双点遥信
	YX_017D	,	//断路器13双点遥信
	YX_017E	,	//断路器14双点遥信
	YX_017F	,	//断路器15双点遥信
	YX_0180	,	//断路器16双点遥信
	YX_0181	,	//线路1有压
	YX_0182	,	//线路2有压
	YX_0183	,	//线路3有压
	YX_0184	,	//线路4有压
	YX_0185	,	//线路5有压
	YX_0186	,	//线路6有压
	YX_0187	,	//线路7有压
	YX_0188	,	//线路8有压
	YX_0189	,	//线路9有压
	YX_018A	,	//线路10有压
	YX_018B	,	//线路11有压
	YX_018C	,	//线路12有压
	YX_018D	,	//线路13有压
	YX_018E	,	//线路14有压
	YX_018F	,	//线路15有压
	YX_0190	,	//线路16有压
	YX_0191	,	//公共遥信1
	YX_0192	,	//公共遥信2
	YX_0193	,	//公共遥信3
	YX_0194	,	//公共遥信4
	YX_0195	,	//远方/就地位置
	YX_0196	,	//电池低压告警/恢复
	YX_0197	,	//终端直流供电
	YX_0198	,	//装置工作电源异常告警/恢复
	YX_0199	,	//电池活化状态
	YX_019A	,	//终端主交流供电
	YX_019B	,	//终端备交流供电
	YX_019C	,	//终端异常/恢复
	//YX_019D	,	//终端温度告警
	YX_019E	,	//公共遥控1本地动作
	YX_019F	,	//公共遥控2本地动作
	YX_01A0	,	//公共遥控3本地动作
	YX_01A1	,	//公共遥控4本地动作
	YX_0201,    //线路1 A相电压越上限告警
	YX_0202,    //线路1 B相电压越上限告警
	YX_0203,    //线路1 C相电压越上限告警
	YX_0204,    //线路1 AB线电压越上限告警
	YX_0205,    //线路1 CB线电压越上限告警
	YX_0206,    //线路1 零序电压越上限告警
	YX_0207,    //线路1 A相电压越下限告警
	YX_0208,    //线路1 B相电压越下限告警
	YX_0209,    //线路1 C相电压越下限告警
	YX_020A,    //线路1 AB线电压越下限告警
	YX_020B,    //线路1 CB线电压越下限告警
	YX_020C,    //线路1 A相电流越上限告警
	YX_020D,    //线路1 B相电流越上限告警
	YX_020E,    //线路1 C相电流越上限告警
	YX_020F,    //线路1 零序电流越上限告警
	YX_0210,    //线路1 负荷越上限告警
	YX_0211,    //线路2 A相电压越上限告警
	YX_0212,    //线路2 B相电压越上限告警
	YX_0213,    //线路2 C相电压越上限告警
	YX_0214,    //线路2 AB线电压越上限告警
	YX_0215,    //线路2 CB线电压越上限告警
	YX_0216,    //线路2 零序电压越上限告警
	YX_0217,    //线路2 A相电压越下限告警
	YX_0218,    //线路2 B相电压越下限告警
	YX_0219,    //线路2 C相电压越下限告警
	YX_021A,    //线路2 AB线电压越下限告警
	YX_021B,    //线路2 CB线电压越下限告警
	YX_021C,    //线路2 A相电流越上限告警
	YX_021D,    //线路2 B相电流越上限告警
	YX_021E,    //线路2 C相电流越上限告警
	YX_021F,    //线路2 零序电流越上限告警
	YX_0220,    //线路2 负荷越上限告警
	YX_0221,    //线路3 A相电压越上限告警
	YX_0222,    //线路3 B相电压越上限告警
	YX_0223,    //线路3 C相电压越上限告警
	YX_0224,    //线路3 AB线电压越上限告警
	YX_0225,    //线路3 CB线电压越上限告警
	YX_0226,    //线路3 零序电压越上限告警
	YX_0227,    //线路3 A相电压越下限告警
	YX_0228,    //线路3 B相电压越下限告警
	YX_0229,    //线路3 C相电压越下限告警
	YX_022A,    //线路3 AB线电压越下限告警
	YX_022B,    //线路3 CB线电压越下限告警
	YX_022C,    //线路3 A相电流越上限告警
	YX_022D,    //线路3 B相电流越上限告警
	YX_022E,    //线路3 C相电流越上限告警
	YX_022F,    //线路3 零序电流越上限告警
	YX_0230,    //线路3 负荷越上限告警
	YX_0231,    //线路4 A相电压越上限告警
	YX_0232,    //线路4 B相电压越上限告警
	YX_0233,    //线路4 C相电压越上限告警
	YX_0234,    //线路4 AB线电压越上限告警
	YX_0235,    //线路4 CB线电压越上限告警
	YX_0236,    //线路4 零序电压越上限告警
	YX_0237,    //线路4 A相电压越下限告警
	YX_0238,    //线路4 B相电压越下限告警
	YX_0239,    //线路4 C相电压越下限告警
	YX_023A,    //线路4 AB线电压越下限告警
	YX_023B,    //线路4 CB线电压越下限告警
	YX_023C,    //线路4 A相电流越上限告警
	YX_023D,    //线路4 B相电流越上限告警
	YX_023E,    //线路4 C相电流越上限告警
	YX_023F,    //线路4 零序电流越上限告警
	YX_0240,    //线路4 负荷越上限告警
	YX_0241,    //线路5 A相电压越上限告警
	YX_0242,    //线路5 B相电压越上限告警
	YX_0243,    //线路5 C相电压越上限告警
	YX_0244,    //线路5 AB线电压越上限告警
	YX_0245,    //线路5 CB线电压越上限告警
	YX_0246,    //线路5 零序电压越上限告警
	YX_0247,    //线路5 A相电压越下限告警
	YX_0248,    //线路5 B相电压越下限告警
	YX_0249,    //线路5 C相电压越下限告警
	YX_024A,    //线路5 AB线电压越下限告警
	YX_024B,    //线路5 CB线电压越下限告警
	YX_024C,    //线路5 A相电流越上限告警
	YX_024D,    //线路5 B相电流越上限告警
	YX_024E,    //线路5 C相电流越上限告警
	YX_024F,    //线路5 零序电流越上限告警
	YX_0250,    //线路5 负荷越上限告警
	YX_0251,    //线路6 A相电压越上限告警
	YX_0252,    //线路6 B相电压越上限告警
	YX_0253,    //线路6 C相电压越上限告警
	YX_0254,    //线路6 AB线电压越上限告警
	YX_0255,    //线路6 CB线电压越上限告警
	YX_0256,    //线路6 零序电压越上限告警
	YX_0257,    //线路6 A相电压越下限告警
	YX_0258,    //线路6 B相电压越下限告警
	YX_0259,    //线路6 C相电压越下限告警
	YX_025A,    //线路6 AB线电压越下限告警
	YX_025B,    //线路6 CB线电压越下限告警
	YX_025C,    //线路6 A相电流越上限告警
	YX_025D,    //线路6 B相电流越上限告警
	YX_025E,    //线路6 C相电流越上限告警
	YX_025F,    //线路6 零序电流越上限告警
	YX_0260,    //线路6 负荷越上限告警
	YX_0261,    //线路7 A相电压越上限告警
	YX_0262,    //线路7 B相电压越上限告警
	YX_0263,    //线路7 C相电压越上限告警
	YX_0264,    //线路7 AB线电压越上限告警
	YX_0265,    //线路7 CB线电压越上限告警
	YX_0266,    //线路7 零序电压越上限告警
	YX_0267,    //线路7 A相电压越下限告警
	YX_0268,    //线路7 B相电压越下限告警
	YX_0269,    //线路7 C相电压越下限告警
	YX_026A,    //线路7 AB线电压越下限告警
	YX_026B,    //线路7 CB线电压越下限告警
	YX_026C,    //线路7 A相电流越上限告警
	YX_026D,    //线路7 B相电流越上限告警
	YX_026E,    //线路7 C相电流越上限告警
	YX_026F,    //线路7 零序电流越上限告警
	YX_0270,    //线路7 负荷越上限告警
	YX_0271,    //线路8 A相电压越上限告警
	YX_0272,    //线路8 B相电压越上限告警
	YX_0273,    //线路8 C相电压越上限告警
	YX_0274,    //线路8 AB线电压越上限告警
	YX_0275,    //线路8 CB线电压越上限告警
	YX_0276,    //线路8 零序电压越上限告警
	YX_0277,    //线路8 A相电压越下限告警
	YX_0278,    //线路8 B相电压越下限告警
	YX_0279,    //线路8 C相电压越下限告警
	YX_027A,    //线路8 AB线电压越下限告警
	YX_027B,    //线路8 CB线电压越下限告警
	YX_027C,    //线路8 A相电流越上限告警
	YX_027D,    //线路8 B相电流越上限告警
	YX_027E,    //线路8 C相电流越上限告警
	YX_027F,    //线路8 零序电流越上限告警
	YX_0280,    //线路8 负荷越上限告警
	YX_0281,    //线路9 A相电压越上限告警
	YX_0282,    //线路9 B相电压越上限告警
	YX_0283,    //线路9 C相电压越上限告警
	YX_0284,    //线路9 AB线电压越上限告警
	YX_0285,    //线路9 CB线电压越上限告警
	YX_0286,    //线路9 零序电压越上限告警
	YX_0287,    //线路9 A相电压越下限告警
	YX_0288,    //线路9 B相电压越下限告警
	YX_0289,    //线路9 C相电压越下限告警
	YX_028A,    //线路9 AB线电压越下限告警
	YX_028B,    //线路9 CB线电压越下限告警
	YX_028C,    //线路9 A相电流越上限告警
	YX_028D,    //线路9 B相电流越上限告警
	YX_028E,    //线路9 C相电流越上限告警
	YX_028F,    //线路9 零序电流越上限告警
	YX_0290,    //线路9 负荷越上限告警
	YX_0291,    //线路10 A相电压越上限告警
	YX_0292,    //线路10 B相电压越上限告警
	YX_0293,    //线路10 C相电压越上限告警
	YX_0294,    //线路10 AB线电压越上限告警
	YX_0295,    //线路10 CB线电压越上限告警
	YX_0296,    //线路10 零序电压越上限告警
	YX_0297,    //线路10 A相电压越下限告警
	YX_0298,    //线路10 B相电压越下限告警
	YX_0299,    //线路10 C相电压越下限告警
	YX_029A,    //线路10 AB线电压越下限告警
	YX_029B,    //线路10 CB线电压越下限告警
	YX_029C,    //线路10 A相电流越上限告警
	YX_029D,    //线路10 B相电流越上限告警
	YX_029E,    //线路10 C相电流越上限告警
	YX_029F,    //线路10 零序电流越上限告警
	YX_02A0,    //线路10 负荷越上限告警
	YX_02A1,    //线路11 A相电压越上限告警
	YX_02A2,    //线路11 B相电压越上限告警
	YX_02A3,    //线路11 C相电压越上限告警
	YX_02A4,    //线路11 AB线电压越上限告警
	YX_02A5,    //线路11 CB线电压越上限告警
	YX_02A6,    //线路11 零序电压越上限告警
	YX_02A7,    //线路11 A相电压越下限告警
	YX_02A8,    //线路11 B相电压越下限告警
	YX_02A9,    //线路11 C相电压越下限告警
	YX_02AA,    //线路11 AB线电压越下限告警
	YX_02AB,    //线路11 CB线电压越下限告警
	YX_02AC,    //线路11 A相电流越上限告警
	YX_02AD,    //线路11 B相电流越上限告警
	YX_02AE,    //线路11 C相电流越上限告警
	YX_02AF,    //线路11 零序电流越上限告警
	YX_02B0,    //线路11 负荷越上限告警
	YX_02B1,    //线路12 A相电压越上限告警
	YX_02B2,    //线路12 B相电压越上限告警
	YX_02B3,    //线路12 C相电压越上限告警
	YX_02B4,    //线路12 AB线电压越上限告警
	YX_02B5,    //线路12 CB线电压越上限告警
	YX_02B6,    //线路12 零序电压越上限告警
	YX_02B7,    //线路12 A相电压越下限告警
	YX_02B8,    //线路12 B相电压越下限告警
	YX_02B9,    //线路12 C相电压越下限告警
	YX_02BA,    //线路12 AB线电压越下限告警
	YX_02BB,    //线路12 CB线电压越下限告警
	YX_02BC,    //线路12 A相电流越上限告警
	YX_02BD,    //线路12 B相电流越上限告警
	YX_02BE,    //线路12 C相电流越上限告警
	YX_02BF,    //线路12 零序电流越上限告警
	YX_02C0,    //线路12 负荷越上限告警
	YX_02C1,    //线路13 A相电压越上限告警
	YX_02C2,    //线路13 B相电压越上限告警
	YX_02C3,    //线路13 C相电压越上限告警
	YX_02C4,    //线路13 AB线电压越上限告警
	YX_02C5,    //线路13 CB线电压越上限告警
	YX_02C6,    //线路13 零序电压越上限告警
	YX_02C7,    //线路13 A相电压越下限告警
	YX_02C8,    //线路13 B相电压越下限告警
	YX_02C9,    //线路13 C相电压越下限告警
	YX_02CA,    //线路13 AB线电压越下限告警
	YX_02CB,    //线路13 CB线电压越下限告警
	YX_02CC,    //线路13 A相电流越上限告警
	YX_02CD,    //线路13 B相电流越上限告警
	YX_02CE,    //线路13 C相电流越上限告警
	YX_02CF,    //线路13 零序电流越上限告警
	YX_02D0,    //线路13 负荷越上限告警
	YX_02D1,    //线路14 A相电压越上限告警
	YX_02D2,    //线路14 B相电压越上限告警
	YX_02D3,    //线路14 C相电压越上限告警
	YX_02D4,    //线路14 AB线电压越上限告警
	YX_02D5,    //线路14 CB线电压越上限告警
	YX_02D6,    //线路14 零序电压越上限告警
	YX_02D7,    //线路14 A相电压越下限告警
	YX_02D8,    //线路14 B相电压越下限告警
	YX_02D9,    //线路14 C相电压越下限告警
	YX_02DA,    //线路14 AB线电压越下限告警
	YX_02DB,    //线路14 CB线电压越下限告警
	YX_02DC,    //线路14 A相电流越上限告警
	YX_02DD,    //线路14 B相电流越上限告警
	YX_02DE,    //线路14 C相电流越上限告警
	YX_02DF,    //线路14 零序电流越上限告警
	YX_02E0,    //线路14 负荷越上限告警
	YX_02E1,    //线路15 A相电压越上限告警
	YX_02E2,    //线路15 B相电压越上限告警
	YX_02E3,    //线路15 C相电压越上限告警
	YX_02E4,    //线路15 AB线电压越上限告警
	YX_02E5,    //线路15 CB线电压越上限告警
	YX_02E6,    //线路15 零序电压越上限告警
	YX_02E7,    //线路15 A相电压越下限告警
	YX_02E8,    //线路15 B相电压越下限告警
	YX_02E9,    //线路15 C相电压越下限告警
	YX_02EA,    //线路15 AB线电压越下限告警
	YX_02EB,    //线路15 CB线电压越下限告警
	YX_02EC,    //线路15 A相电流越上限告警
	YX_02ED,    //线路15 B相电流越上限告警
	YX_02EE,    //线路15 C相电流越上限告警
	YX_02EF,    //线路15 零序电流越上限告警
	YX_02F0,    //线路15 负荷越上限告警
	YX_02F1,    //线路16 A相电压越上限告警
	YX_02F2,    //线路16 B相电压越上限告警
	YX_02F3,    //线路16 C相电压越上限告警
	YX_02F4,    //线路16 AB线电压越上限告警
	YX_02F5,    //线路16 CB线电压越上限告警
	YX_02F6,    //线路16 零序电压越上限告警
	YX_02F7,    //线路16 A相电压越下限告警
	YX_02F8,    //线路16 B相电压越下限告警
	YX_02F9,    //线路16 C相电压越下限告警
	YX_02FA,    //线路16 AB线电压越下限告警
	YX_02FB,    //线路16 CB线电压越下限告警
	YX_02FC,    //线路16 A相电流越上限告警
	YX_02FD,    //线路16 B相电流越上限告警
	YX_02FE,    //线路16 C相电流越上限告警
	YX_02FF,    //线路16 零序电流越上限告警
	YX_0300,    //线路16 负荷越上限告警
};
static int32 AllYc1[] = {
	YC_4001, //线路1 A相电压
	YC_4002, //线路1 B相电压
	YC_4003, //线路1 C相电压
	YC_4004, //线路1 AB线电压
	YC_4005, //线路1 CB线电压
	YC_4006, //线路1 零序电压
	YC_4007, //线路1 A相测量电流
	YC_4008, //线路1 B相测量电流
	YC_4009, //线路1 C相测量电流
	YC_400A, //线路1 零序电流
	YC_400B, //线路1 A相保护电流
	YC_400C, //线路1 B相保护电流
	YC_400D, //线路1 C相保护电流
	YC_400E, //线路1 总有功功率
	YC_400F, //线路1 总无功功率
	YC_4010, //线路1 总视在功率
	YC_4011, //线路1 总功率因数
	YC_4012, //线路1 频率
	YC_4013, //线路2 A相电压
	YC_4014, //线路2 B相电压
	YC_4015, //线路2 C相电压
	YC_4016, //线路2 AB线电压
	YC_4017, //线路2 CB线电压
	YC_4018, //线路2 零序电压
	YC_4019, //线路2 A相测量电流
	YC_401A, //线路2 B相测量电流
	YC_401B, //线路2 C相测量电流
	YC_401C, //线路2 零序电流
	YC_401D, //线路2 A相保护电流
	YC_401E, //线路2 B相保护电流
	YC_401F, //线路2 C相保护电流
	YC_4020, //线路2 总有功功率
	YC_4021, //线路2 总无功功率
	YC_4022, //线路2 总视在功率
	YC_4023, //线路2 总功率因数
	YC_4024, //线路2 频率
	YC_4025, //线路3 A相电压
	YC_4026, //线路3 B相电压
	YC_4027, //线路3 C相电压
	YC_4028, //线路3 AB线电压
	YC_4029, //线路3 CB线电压
	YC_402A, //线路3 零序电压
	YC_402B, //线路3 A相测量电流
	YC_402C, //线路3 B相测量电流
	YC_402D, //线路3 C相测量电流
	YC_402E, //线路3 零序电流
	YC_402F, //线路3 A相保护电流
	YC_4030, //线路3 B相保护电流
	YC_4031, //线路3 C相保护电流
	YC_4032, //线路3 总有功功率
	YC_4033, //线路3 总无功功率
	YC_4034, //线路3 总视在功率
	YC_4035, //线路3 总功率因数
	YC_4036, //线路3 频率
	YC_4037, //线路4 A相电压
	YC_4038, //线路4 B相电压
	YC_4039, //线路4 C相电压
	YC_403A, //线路4 AB线电压
	YC_403B, //线路4 CB线电压
	YC_403C, //线路4 零序电压
	YC_403D, //线路4 A相测量电流
	YC_403E, //线路4 B相测量电流
	YC_403F, //线路4 C相测量电流
	YC_4040, //线路4 零序电流
	YC_4041, //线路4 A相保护电流
	YC_4042, //线路4 B相保护电流
	YC_4043, //线路4 C相保护电流
	YC_4044, //线路4 总有功功率
	YC_4045, //线路4 总无功功率
	YC_4046, //线路4 总视在功率
	YC_4047, //线路4 总功率因数
	YC_4048, //线路4 频率
	YC_4049, //线路5 A相电压
	YC_404A, //线路5 B相电压
	YC_404B, //线路5 C相电压
	YC_404C, //线路5 AB线电压
	YC_404D, //线路5 CB线电压
	YC_404E, //线路5 零序电压
	YC_404F, //线路5 A相测量电流
	YC_4050, //线路5 B相测量电流
	YC_4051, //线路5 C相测量电流
	YC_4052, //线路5 零序电流
	YC_4053, //线路5 A相保护电流
	YC_4054, //线路5 B相保护电流
	YC_4055, //线路5 C相保护电流
	YC_4056, //线路5 总有功功率
	YC_4057, //线路5 总无功功率
	YC_4058, //线路5 总视在功率
	YC_4059, //线路5 总功率因数
	YC_405A, //线路5 频率
	YC_405B, //线路6 A相电压
	YC_405C, //线路6 B相电压
	YC_405D, //线路6 C相电压
	YC_405E, //线路6 AB线电压
	YC_405F, //线路6 CB线电压
	YC_4060, //线路6 零序电压
	YC_4061, //线路6 A相测量电流
	YC_4062, //线路6 B相测量电流
	YC_4063, //线路6 C相测量电流
	YC_4064, //线路6 零序电流
	YC_4065, //线路6 A相保护电流
	YC_4066, //线路6 B相保护电流
	YC_4067, //线路6 C相保护电流
	YC_4068, //线路6 总有功功率
	YC_4069, //线路6 总无功功率
	YC_406A, //线路6 总视在功率
	YC_406B, //线路6 总功率因数
	YC_406C, //线路6 频率
	YC_406D, //线路7 A相电压
	YC_406E, //线路7 B相电压
	YC_406F, //线路7 C相电压
	YC_4070, //线路7 AB线电压
	YC_4071, //线路7 CB线电压
	YC_4072, //线路7 零序电压
	YC_4073, //线路7 A相测量电流
	YC_4074, //线路7 B相测量电流
	YC_4075, //线路7 C相测量电流
	YC_4076, //线路7 零序电流
	YC_4077, //线路7 A相保护电流
	YC_4078, //线路7 B相保护电流
	YC_4079, //线路7 C相保护电流
	YC_407A, //线路7 总有功功率
	YC_407B, //线路7 总无功功率
	YC_407C, //线路7 总视在功率
	YC_407D, //线路7 总功率因数
	YC_407E, //线路7 频率
	YC_407F, //线路8 A相电压
	YC_4080, //线路8 B相电压
	YC_4081, //线路8 C相电压
	YC_4082, //线路8 AB线电压
	YC_4083, //线路8 CB线电压
	YC_4084, //线路8 零序电压
	YC_4085, //线路8 A相测量电流
	YC_4086, //线路8 B相测量电流
	YC_4087, //线路8 C相测量电流
	YC_4088, //线路8 零序电流
	YC_4089, //线路8 A相保护电流
	YC_408A, //线路8 B相保护电流
	YC_408B, //线路8 C相保护电流
	YC_408C, //线路8 总有功功率
	YC_408D, //线路8 总无功功率
	YC_408E, //线路8 总视在功率
	YC_408F, //线路8 总功率因数
	YC_4090, //线路8 频率
	YC_4091, //线路9 A相电压
	YC_4092, //线路9 B相电压
	YC_4093, //线路9 C相电压
	YC_4094, //线路9 AB线电压
	YC_4095, //线路9 CB线电压
	YC_4096, //线路9 零序电压
	YC_4097, //线路9 A相测量电流
	YC_4098, //线路9 B相测量电流
	YC_4099, //线路9 C相测量电流
	YC_409A, //线路9 零序电流
	YC_409B, //线路9 A相保护电流
	YC_409C, //线路9 B相保护电流
	YC_409D, //线路9 C相保护电流
	YC_409E, //线路9 总有功功率
	YC_409F, //线路9 总无功功率
	YC_40A0, //线路9 总视在功率
	YC_40A1, //线路9 总功率因数
	YC_40A2, //线路9 频率
	YC_40A3, //线路10 A相电压
	YC_40A4, //线路10 B相电压
	YC_40A5, //线路10 C相电压
	YC_40A6, //线路10 AB线电压
	YC_40A7, //线路10 CB线电压
	YC_40A8, //线路10 零序电压
	YC_40A9, //线路10 A相测量电流
	YC_40AA, //线路10 B相测量电流
	YC_40AB, //线路10 C相测量电流
	YC_40AC, //线路10 零序电流
	YC_40AD, //线路10 A相保护电流
	YC_40AE, //线路10 B相保护电流
	YC_40AF, //线路10 C相保护电流
	YC_40B0, //线路10 总有功功率
	YC_40B1, //线路10 总无功功率
	YC_40B2, //线路10 总视在功率
	YC_40B3, //线路10 总功率因数
	YC_40B4, //线路10 频率
	YC_40B5, //线路11 A相电压
	YC_40B6, //线路11 B相电压
	YC_40B7, //线路11 C相电压
	YC_40B8, //线路11 AB线电压
	YC_40B9, //线路11 CB线电压
	YC_40BA, //线路11 零序电压
	YC_40BB, //线路11 A相测量电流
	YC_40BC, //线路11 B相测量电流
	YC_40BD, //线路11 C相测量电流
	YC_40BE, //线路11 零序电流
	YC_40BF, //线路11 A相保护电流
	YC_40C0, //线路11 B相保护电流
	YC_40C1, //线路11 C相保护电流
	YC_40C2, //线路11 总有功功率
	YC_40C3, //线路11 总无功功率
	YC_40C4, //线路11 总视在功率
	YC_40C5, //线路11 总功率因数
	YC_40C6, //线路11 频率
	YC_40C7, //线路12 A相电压
	YC_40C8, //线路12 B相电压
	YC_40C9, //线路12 C相电压
	YC_40CA, //线路12 AB线电压
	YC_40CB, //线路12 CB线电压
	YC_40CC, //线路12 零序电压
	YC_40CD, //线路12 A相测量电流
	YC_40CE, //线路12 B相测量电流
	YC_40CF, //线路12 C相测量电流
	YC_40D0, //线路12 零序电流
	YC_40D1, //线路12 A相保护电流
	YC_40D2, //线路12 B相保护电流
	YC_40D3, //线路12 C相保护电流
	YC_40D4, //线路12 总有功功率
	YC_40D5, //线路12 总无功功率
	YC_40D6, //线路12 总视在功率
	YC_40D7, //线路12 总功率因数
	YC_40D8, //线路12 频率
	YC_40D9, //线路13 A相电压
	YC_40DA, //线路13 B相电压
	YC_40DB, //线路13 C相电压
	YC_40DC, //线路13 AB线电压
	YC_40DD, //线路13 CB线电压
	YC_40DE, //线路13 零序电压
	YC_40DF, //线路13 A相测量电流
	YC_40E0, //线路13 B相测量电流
	YC_40E1, //线路13 C相测量电流
	YC_40E2, //线路13 零序电流
	YC_40E3, //线路13 A相保护电流
	YC_40E4, //线路13 B相保护电流
	YC_40E5, //线路13 C相保护电流
	YC_40E6, //线路13 总有功功率
	YC_40E7, //线路13 总无功功率
	YC_40E8, //线路13 总视在功率
	YC_40E9, //线路13 总功率因数
	YC_40EA, //线路13 频率
	YC_40EB, //线路14 A相电压
	YC_40EC, //线路14 B相电压
	YC_40ED, //线路14 C相电压
	YC_40EE, //线路14 AB线电压
	YC_40EF, //线路14 CB线电压
	YC_40F0, //线路14 零序电压
	YC_40F1, //线路14 A相测量电流
	YC_40F2, //线路14 B相测量电流
	YC_40F3, //线路14 C相测量电流
	YC_40F4, //线路14 零序电流
	YC_40F5, //线路14 A相保护电流
	YC_40F6, //线路14 B相保护电流
	YC_40F7, //线路14 C相保护电流
	YC_40F8, //线路14 总有功功率
	YC_40F9, //线路14 总无功功率
	YC_40FA, //线路14 总视在功率
	YC_40FB, //线路14 总功率因数
	YC_40FC, //线路14 频率
	YC_40FD, //线路15 A相电压
	YC_40FE, //线路15 B相电压
	YC_40FF, //线路15 C相电压
	YC_4100, //线路15 AB线电压
	YC_4101, //线路15 CB线电压
	YC_4102, //线路15 零序电压
	YC_4103, //线路15 A相测量电流
	YC_4104, //线路15 B相测量电流
	YC_4105, //线路15 C相测量电流
	YC_4106, //线路15 零序电流
	YC_4107, //线路15 A相保护电流
	YC_4108, //线路15 B相保护电流
	YC_4109, //线路15 C相保护电流
	YC_410A, //线路15 总有功功率
	YC_410B, //线路15 总无功功率
	YC_410C, //线路15 总视在功率
	YC_410D, //线路15 总功率因数
	YC_410E, //线路15 频率
	YC_410F, //线路16 A相电压
	YC_4110, //线路16 B相电压
	YC_4111, //线路16 C相电压
	YC_4112, //线路16 AB线电压
	YC_4113, //线路16 CB线电压
	YC_4114, //线路16 零序电压
	YC_4115, //线路16 A相测量电流
	YC_4116, //线路16 B相测量电流
	YC_4117, //线路16 C相测量电流
	YC_4118, //线路16 零序电流
	YC_4119, //线路16 A相保护电流
	YC_411A, //线路16 B相保护电流
	YC_411B, //线路16 C相保护电流
	YC_411C, //线路16 总有功功率
	YC_411D, //线路16 总无功功率
	YC_411E, //线路16 总视在功率
	YC_411F, //线路16 总功率因数
	YC_4120, //线路16 频率
};  
static int32 AllYc2[] = {     
   PARA_6801,///<32比特串
};
static int32 AllPara[] = {  
PARA_5001,   //第1套 I段电流定值（瞬时电流速断保护）    
PARA_5002,   //第1套定值II段电流定值（定时限电流速断保护） 
PARA_5003,   //第1套定值III段电流定值（定时限过电流保护）   
PARA_5004,   //第1套定值零序I段电流保护定值                 
PARA_5005,   //第1套定值零序II段电流保护定值                
PARA_5006,   //第1套定值零序III段电流保护定值               
PARA_5007,   //第1套定值零序电压保护定值                    
PARA_5008,   //第1套定值电流方向保护投入定值                
PARA_5009,   //第1套定值零序电流方向保护投入定值 
PARA_500A,   //第2套定值I段电流定值（瞬时电流速断保护）    
PARA_500B,   //第2套定值II段电流定值（定时限电流速断保护） 
PARA_500C,   //第2套定值III段电流定值（定时限过电流保护）   
PARA_500D,   //第2套定值零序I段电流保护定值                 
PARA_500E,   //第2套定值零序II段电流保护定值                
PARA_500F,   //第2套定值零序III段电流保护定值               
PARA_5010,   //第2套定值零序电压保护定值                    
PARA_5011,   //第2套定值电流方向保护投入定值                
PARA_5012,   //第2套定值零序电流方向保护投入定值 
PARA_5013,   //第3套定值I段电流定值（瞬时电流速断保护）    
PARA_5014,   //第3套定值II段电流定值（定时限电流速断保护） 
PARA_5015,   //第3套定值III段电流定值（定时限过电流保护）   
PARA_5016,   //第3套定值零序I段电流保护定值                 
PARA_5017,   //第3套定值零序II段电流保护定值                
PARA_5018,   //第3套定值零序III段电流保护定值               
PARA_5019,   //第3套定值零序电压保护定值                    
PARA_501A,   //第3套定值电流方向保护投入定值                
PARA_501B,   //第3套定值零序电流方向保护投入定值 
PARA_501C,   //第4套定值I段电流定值（瞬时电流速断保护）    
PARA_501D,   //第4套定值II段电流定值（定时限电流速断保护） 
PARA_501E,   //第4套定值III段电流定值（定时限过电流保护）   
PARA_501F,   //第4套定值零序I段电流保护定值                 
PARA_5020,   //第4套定值零序II段电流保护定值                
PARA_5021,   //第4套定值零序III段电流保护定值               
PARA_5022,   //第4套定值零序电压保护定值                    
PARA_5023,   //第4套定值电流方向保护投入定值                
PARA_5024,   //第4套定值零序电流方向保护投入定值 
PARA_5025,   //第5套定值I段电流定值（瞬时电流速断保护）    
PARA_5026,   //第5套定值II段电流定值（定时限电流速断保护） 
PARA_5027,   //第5套定值III段电流定值（定时限过电流保护）   
PARA_5028,   //第5套定值零序I段电流保护定值                 
PARA_5029,   //第5套定值零序II段电流保护定值                
PARA_502A,   //第5套定值零序III段电流保护定值               
PARA_502B,   //第5套定值零序电压保护定值                    
PARA_502C,   //第5套定值电流方向保护投入定值                
PARA_502D,   //第5套定值零序电流方向保护投入定值 
PARA_502E,   //第6套定值I段电流定值（瞬时电流速断保护）    
PARA_502F,   //第6套定值II段电流定值（定时限电流速断保护） 
PARA_5030,   //第6套定值III段电流定值（定时限过电流保护）   
PARA_5031,   //第6套定值零序I段电流保护定值                 
PARA_5032,   //第6套定值零序II段电流保护定值                
PARA_5033,   //第6套定值零序III段电流保护定值               
PARA_5034,   //第6套定值零序电压保护定值                    
PARA_5035,   //第6套定值电流方向保护投入定值                
PARA_5036,   //第6套定值零序电流方向保护投入定值 
PARA_5037,   //第7套定值I段电流定值（瞬时电流速断保护）    
PARA_5038,   //第7套定值II段电流定值（定时限电流速断保护） 
PARA_5039,   //第7套定值III段电流定值（定时限过电流保护）   
PARA_503A,   //第7套定值零序I段电流保护定值                 
PARA_503B,   //第7套定值零序II段电流保护定值                
PARA_503C,   //第7套定值零序III段电流保护定值               
PARA_503D,   //第7套定值零序电压保护定值                    
PARA_503E,   //第7套定值电流方向保护投入定值                
PARA_503F,   //第7套定值零序电流方向保护投入定值 
PARA_5040,   //第8套定值I段电流定值（瞬时电流速断保护）    
PARA_5041,   //第8套定值II段电流定值（定时限电流速断保护） 
PARA_5042,   //第8套定值III段电流定值（定时限过电流保护）   
PARA_5043,   //第8套定值零序I段电流保护定值                 
PARA_5044,   //第8套定值零序II段电流保护定值                
PARA_5045,   //第8套定值零序III段电流保护定值               
PARA_5046,   //第8套定值零序电压保护定值                    
PARA_5047,   //第8套定值电流方向保护投入定值                
PARA_5048,   //第8套定值零序电流方向保护投入定值 
PARA_5049,   //线路1~8保护定值区号设置
PARA_504A,   //线路9~16保护定值区号设置
PARA_504B,   //<重合闸设置
PARA_504C,   //<FA功能设置        
PARA_504D,   //<分段开关设置        
PARA_504E,   //<联络开关设置        
PARA_504F,   //<FA功能设置        
PARA_5050,   //<分段开关设置        
PARA_5051,   //<联络开关设置        
PARA_5052,   //<线路1 FA定值区号设置  
PARA_5053,   //<线路2 FA定值区号设置  
PARA_5054,   //保护公共定值
PARA_5055,   //保护投入与退出
PARA_5056,   //故障信号复归
PARA_5057,   //故障信号关联出口（1~4回）
PARA_5058,   //故障信号关联出口（5~8回）
PARA_5059,   //故障信号关联出口（9~12回）
PARA_505A,   //故障信号关联出口（13~16回）
PARA_505B,   //故障信号关联出口功能允许
PARA_505C,   //出口继电器软压板
PARA_505D,   //分回线远方就地开关设置（1~4回）
PARA_505E,   //分回线远方就地开关设置（5~8回）
PARA_505F,   //分回线远方就地开关设置（9~12回）
PARA_5060,   //分回线远方就地开关设置（13~16回）
PARA_5061,   //分回线远方就地开关设置允许
PARA_5062,   //出口继电器1~16类型
PARA_5063,   //出口继电器17~32类型
PARA_507F,   //<基波算法还是全波算法                                        
PARA_5080,   //模拟输入量的硬件端口配置
PARA_5081,   //模拟输入量的硬件端口配置
PARA_5082,   //模拟输入量的硬件端口配置
PARA_5083,   //模拟输入量的硬件端口配置
PARA_5084,   //模拟输入量的硬件端口配置
PARA_5085,   //开关输入量的硬件端口配置
PARA_5086,   //开关输入量的硬件端口配置
PARA_5087,   //开关输入量的硬件端口配置
PARA_5088,   //开关输入量的硬件端口配置
PARA_5089,   //双点遥信硬件端口配置
PARA_508A,   //开关输出量的硬件端口配置
PARA_508B,   //功率计算方法配置
PARA_508C,   //直流量配置
PARA_508D,   //电流标称值是5A还是1A,                                    
PARA_508E,   //电压标称值 220V还是110V                                      
PARA_508F,   //遥测死区值设置
PARA_5090,   //遥信防抖时间                                            
PARA_5091,   //遥控返校失败取消遥控时间                                      
PARA_5092,   //遥控保持时间                                           
PARA_5093,   //遥控脉冲宽度                                            
PARA_5094,   //延时断开操作电源时间                                       
PARA_5095,   //PT                                               
PARA_5096,   //CT                                                
//PARA_5097,   //标定                                               
PARA_5098,   //遥测信息体属性配置      
PARA_5099,   //遥测信息体属性配置      
PARA_509A,   //遥测信息体属性配置      
PARA_509B,   //遥测信息体属性配置      
PARA_509C,   //遥测信息体属性配置      
PARA_509D,   //遥测信息体属性配置      
PARA_509E,   //遥测信息体属性配置      
PARA_509F,   //遥测信息体属性配置      
PARA_50A0,   //遥测信息体属性配置      
PARA_50A1,   //遥测信息体属性配置      
PARA_50A2,   //遥测信息体属性配置      
PARA_50A3,   //遥测信息体属性配置      
PARA_50A4,   //遥测信息体属性配置      
PARA_50A5,   //遥测信息体属性配置      
PARA_50A6,   //遥测信息体属性配置      
PARA_50A7,   //遥测信息体属性配置      
PARA_50A8,   //遥测信息体属性配置      
PARA_50A9,   //遥测信息体属性配置      
PARA_50AA,   //遥测信息体属性配置      
PARA_50AB,   //遥测信息体属性配置      
PARA_50AC,   //遥测信息体属性配置      
PARA_50AD,   //遥信信息体属性配置
PARA_50AE,   //遥信信息体属性配置
PARA_50AF,   //遥信信息体属性配置
PARA_50B0,   //遥信信息体属性配置
PARA_50B1,   //遥信信息体属性配置
PARA_50B2,   //遥信信息体属性配置
PARA_50B3,   //遥信信息体属性配置
PARA_50B4,   //遥信信息体属性配置
PARA_50B5,   //遥信信息体属性配置
PARA_50B6,   //遥信信息体属性配置
PARA_50B7,   //遥信信息体属性配置
PARA_50B8,   //遥信信息体属性配置
PARA_50B9,   //遥信信息体属性配置
PARA_50BA,   //遥信信息体属性配置
PARA_50BB,   //遥信信息体属性配置
PARA_50BC,   //遥信信息体属性配置
PARA_50BD,   //遥信信息体属性配置
PARA_50BE,   //遥信信息体属性配置
PARA_50BF,   //遥信信息体属性配置
PARA_50C0,   //遥信信息体属性配置
PARA_50C1,   //遥信信息体属性配置
PARA_50C2,   //遥信信息体属性配置
PARA_50C3,   //遥信信息体属性配置
PARA_50C4,   //遥信信息体属性配置
PARA_50C5,   //遥信信息体属性配置
PARA_50C6,   //遥信信息体属性配置
PARA_50C7,   //遥信信息体属性配置
PARA_50C8,   //遥信信息体属性配置
PARA_50C9,   //遥信信息体属性配置
PARA_50CA,   //遥信信息体属性配置
PARA_50CB,   //遥控信息体属性配置
PARA_5200,   ///**密码*/                     
PARA_5201,   ///**版本*/                     
PARA_5202,   ///**温度定值*/                   
PARA_5203,   ///**湿度定值*/                   
PARA_5204,   ///**经度坐标*/                   
PARA_5205,   ///**纬度坐标*/                   
PARA_5206,   ///**恢复出厂设置*/                 
PARA_5207,   ///**蓄电池欠压切除阈值*/              
PARA_5208,   ///**蓄电池低压告警阈值*/              
PARA_5209,   ///**蓄电池活化充放电间隔时间*/           
PARA_520A,   ///*电压上限告警阈值，恢复阈值，持续时间*/      
PARA_520B,   ///*电压下限告警阈值，恢复阈值，持续时间*/      
PARA_520C,   ///*电流上限阈值，恢复阈值，持续时间*/        
PARA_520D,   ///*负荷越上限阈值，恢复阈值，持续时间*/       
PARA_520E,   //零序电压上限告警参数
PARA_520F,   //零序电流上限告警参数
PARA_5210,   ///*遥测历史数据项定义*/               
PARA_5211,   ///*遥测历史数据存储间隔*/              
PARA_5212,   ///*遥测极值数据项定义*/               
PARA_5213,   ///*人工值设置使能*/                 
PARA_5214,   ///*人工设置数据*/                  
PARA_5215,   ///*CP56Time2a格式终端时间*/        
PARA_5216,   //终端类型,三遥型：D30；二遥标准型：D21；二遥动作型：D22
};
static struct mutex vdsp_mutex;
/** /brief 需要定义一个全局函数Task类处理该类的入口
*/
void* vdsp_main ( void*arg )
{
    vdsp.Run ( arg );
    return NULL;
}
/** /brief 需要定义一个全局函数供注册消息类处理消息
*/
static int16 GetMsg2 ( MessageData<BaseDataType>message )
{
    vdsp.GetMsg ( message );
    return 1;
}
Vdsp::Vdsp()
{
    strcpy ( name, "Vdsp" );
    Id = TASK_VDSP;
}
Vdsp::~Vdsp()
{
    mutex_destroy ( &vdsp_mutex );
    PFUNC ( TEM_WARNING,DEBUG_VDSP, "Destroy Vdsp\r\n" );
}
int ( syslink_write ) ( char *buf , uint32 len ) //写数据
{
	syslink.Write(buf,len);
    //dump_binary((uint8*)buf,len);
    return 1;
}
int ( syslink_read ) ( char *buf , uint32* len ) //读数据
{
	syslink.Read(buf,len);
    //dump_binary((uint8*)buf,*len);
    return 1;
}
int ( syslink_checkmsg ) ( char *buf , uint32 *len ) //读消息
{
		syslink.CheckEvent(buf,len);
		if(*len>0)
		{	
		//dump_binary((uint8 *)buf,*len);
		return 1;
		}
    return 0;
}
int ( syslink_init ) ( void ) //初始化
{
		syslink.StartUpDsp();
		syslink.SysLinkInit();
    PFUNC ( TEM_INFO,DEBUG_VDSP, "Init syslink\n" );
    return 1;
}
int16 Vdsp::Init()
{
    mutex_init ( &vdsp_mutex, "varm mutex" );
    //msg.RegistMsg ( Id, GetMsg2 );///<向message类注册线程号以及消息回调函数
    fun_init = syslink_init;
    fun_write = syslink_write;
    fun_read = syslink_read;
    fun_checkmsg = syslink_checkmsg;
		if(first_run==0){
    thread_wait_cond ( &user_data.cond );//等待参数装载完毕
    first_run=1;
  	}
    start_syslink=0;
    fun_init();
		start_syslink=1;
    return 1;
}
int16 Vdsp::Run ( void*arg )
{
    uint16 i=0;
	int index;
    int count=0;
	int total_para;
	Init();
	total_para=sizeof ( AllPara ) / sizeof ( int32 );
	for(i=0;i<total_para;i++){//avoid too long time
		items[0].Id=AllPara[i];
		SetData(1,items);
		Heart();
	}
    while ( 1 ) {
        mdelay ( 10 );
        GetMsg();
        CheckMsg();
        Heart();
        count++;
		if(count>500){//5s 总招一次
        PFUNC ( TEM_INFO,DEBUG_VDSP, "vdsp run\n " );
		count=0;
	        for ( i = 0;i < sizeof ( AllYx ) / sizeof ( int32 );i++ ) {
	            items[i].Id = AllYx[i];
	        }
					//SetData ( i, items );
	        GetData ( i, items );
	        for ( i = 0;i < sizeof ( AllYc1 ) / sizeof ( int32 );i++ ) {
	            items[i].Id = AllYc1[i];
	        }
					//SetData ( i, items );
	        GetData ( i, items );
	        for ( i = 0;i < sizeof ( AllYc2 ) / sizeof ( int32 );i++ ) {
	            items[i].Id = AllYc2[i];
	        }
					//SetData ( i, items );
	        GetData ( i, items );
		}
        //items[0].Id = PARA_5213;
		//SetData ( 1, items );
        CHECK_TASK_EXIT ( ( ( TASK* ) arg ) );
    }
	msg.UnRegistMsg ( Id );
	syslink.SysLinkFnit();
    PFUNC ( TEM_WARNING,DEBUG_VDSP, "Exit Vdsp Run\r\n" );
    return 1;
}
/*
检查DSP侧消息，每次传递消息总长不要超过32K，消息条数不要超过10条
*/
void Vdsp::CheckMsg()
{
    //PFUNC ( TEM_INFO,DEBUG_VDSP, "vdsp check msg\r\n" );
    char *buf;
    uint32 len;
    int16 i;
    DataHead *Head;
    char *dataptr,*itemptr, *buf2;
    CP56Time2a *time;
    Item items[10];
    MessageData<BaseDataType> msg_data;
    buf = msg_buf;
    len=0;
    fun_checkmsg ( msg_buf, &len );
    if ( len>0 ) {
        Head = ( DataHead * ) buf;
        dataptr = buf + sizeof ( Head->Num ) + Head->Num * sizeof ( Item );
        buf2=dataptr;
        itemptr = buf + sizeof ( Head->Num );
				memcpy((char*)&items[0],itemptr,Head->Num * sizeof ( Item ));
        for ( i = 0;i < Head->Num;i++ ) {
            msg_data.Id = items[i].Id;
            msg_data.MessageId = user_data.GetDataType ( msg_data.Id ) ;
            user_data.SetData(msg_data.Id,dataptr);
            dataptr += ( items[i].Len-sizeof ( msg_data.Time ) );
            time = ( CP56Time2a* ) dataptr;
            dataptr += sizeof ( msg_data.Time );
            msg.SendMsg ( ( TASK_ALL ) , msg_data.MessageId, msg_data.Id, buf2, time );
            buf2=dataptr;
        }
    }
}
int16 Vdsp::GetMsg ( MessageData<BaseDataType>message )
{
    Item items;
    PFUNC ( TEM_INFO,DEBUG_VDSP, "%s deal  Message\r\n", name );
if(start_syslink){
    if ( message.MessageId == MSG_YX ) {
        PFUNC ( TEM_INFO,DEBUG_VDSP, "%s rcv YX Message\r\n", name );
    }
    if ( message.MessageId == MSG_YC ) {
        PFUNC ( TEM_INFO,DEBUG_VDSP, "%s rcv YC Message\r\n", name );
    }
    if ( message.MessageId == MSG_YK ) {
        PFUNC ( TEM_INFO,DEBUG_PRO101, "%s rcv YK Message\r\n", name );
        items.Id = message.Id;
        SetData ( 1, &items );
    }
    if ( message.MessageId == MSG_PARA ) {
        PFUNC ( TEM_INFO,DEBUG_VDSP, "%s rcv PARA Message\r\n", name );
        items.Id = message.Id;
        SetData ( 1, &items );
    }
}
    return 1;
}
void Vdsp::GetMsg ( )
{	
    Item items;
    MessageData<BaseDataType> *msgdata;
    MessageData<BaseDataType> message;
    if ( msg.GetMsg ( TASK_VDSP, &msgdata ) ) {   
    	 message = *msgdata;
    if ( message.MessageId == MSG_YX ) {
        PFUNC ( TEM_INFO,DEBUG_VDSP, "%s rcv YX Message\r\n", name );
        items.Id = message.Id;
        SetData ( 1, &items );        
    }
    if ( message.MessageId == MSG_YC ) {
        PFUNC ( TEM_INFO,DEBUG_VDSP, "%s rcv YC Message\r\n", name );
    }
    if ( message.MessageId == MSG_YK ) {
        PFUNC ( TEM_INFO,DEBUG_VDSP, "%s rcv YK Message\r\n", name );
        items.Id = message.Id;
        SetData ( 1, &items );
    }
    if ( message.MessageId == MSG_PARA ) {
        PFUNC ( TEM_INFO,DEBUG_VDSP, "%s rcv PARA Message\r\n", name );
        items.Id = message.Id;
        SetData ( 1, &items );
    }    	  
    }
}    
int16 Vdsp::GetData ( int16 Num, Item*items )
{
    uint32 total_len, item_len;
    int i;
    DataHead Head;
    char *DataBuf, *old_buf;
    char *dataptr;
    mutex_lock ( &vdsp_mutex );
    Head.Num = Num;
    item_len = 0;
    total_len = sizeof ( Head.Num );
    for ( i = 0;i < Head.Num;i++ ) {
        total_len += sizeof ( Item );
        item_len += sizeof ( Item );
        items[i].Len = user_data.GetDataSize ( items[i].Id );
        total_len += items[i].Len;
    }
    DataBuf = ( char * ) malloc ( total_len );
    old_buf = DataBuf;
    memcpy ( DataBuf, &Head.Num, sizeof ( Head.Num ) );
    DataBuf += sizeof ( Head.Num );
    memcpy ( DataBuf, items, item_len );
    DataBuf += item_len;
    dataptr = DataBuf;
    fun_read ( old_buf, &total_len );
    for ( i = 0;i < Num;i++ ) {
        user_data.SetData(items[i].Id,dataptr);
        dataptr += items[i].Len;
    }
  	free ( old_buf );
    mutex_unlock ( &vdsp_mutex );
    return 0;
}
int16 Vdsp::SetData ( int16 Num, Item*items )
{
    Data<DataType1> *data;
    int16 total_len, i, item_len;
    DataHead Head;
    char *DataBuf, *old_p;
    char *dataptr;
    mutex_lock ( &vdsp_mutex );
    Head.Num = Num;
    item_len = 0;
    total_len =sizeof ( Head.Num );
    for ( i = 0;i < Head.Num;i++ ) {
        total_len += sizeof ( Item );
        item_len += sizeof ( Item );
        items[i].Len = user_data.GetDataSize ( items[i].Id );
        total_len += items[i].Len;
    }
    DataBuf = ( char * ) malloc ( total_len );
    old_p = DataBuf;
    memcpy ( DataBuf, &Head.Num, sizeof ( Head.Num ) );
    DataBuf += sizeof ( Head.Num );
    memcpy ( DataBuf, items, item_len );
    DataBuf += item_len;
    dataptr = DataBuf;
    for ( i = 0;i < Num;i++ ) {
        data = ( Data<DataType1> * ) user_data.GetDataPtr ( items[i].Id );
        memcpy ( dataptr, ( char * ) &data->Data->Data, data->Size );
        dataptr += data->Size;
    }
    fun_write ( old_p, total_len );
    free ( old_p );
    mutex_unlock ( &vdsp_mutex );
    return 0;
}
#endif
